## 7 Feb 2026

In [1]:
import pandas as pd

In [4]:
data = pd.read_csv('datasets/Iris.csv')

In [6]:
type(data) ## It will return the type of datatype is a dataframe.

pandas.core.frame.DataFrame

In [8]:
data.columns ## It will return the columns name is a array format.

Index(['Sepal_Length', 'Sepal_Width', 'Petal_Length', 'Petal_Width',
       'Species'],
      dtype='object')

In [10]:
data.shape## It will return the numbers of row and columns present in a data.

(150, 5)

In [12]:
data.head()## It will return the start 5 rows data.

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [14]:
data.head(10) ## It will return number of record we want in categorical format.

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa
5           5.4          3.9           1.7          0.4  Setosa
6           4.6          3.4           1.4          0.3  Setosa
7           5.0          3.4           1.5          0.2  Setosa
8           4.4          2.9           1.4          0.2  Setosa
9           4.9          3.1           1.5          0.1  Setosa

In [18]:
data.tail() ## It will return the ending 5 rows data.
# data.tail(7) ->> and this one is return how many data we want.

     Sepal_Length  Sepal_Width  Petal_Length  Petal_Width    Species
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

In [23]:
# data['Species'].unique() ## Reeturn the unique value in array format not duplicate one.
data['Species'].nunique() ## Return in numerical format unique values.

3

In [25]:
data['Species'].value_counts() ## return the number of species present in series.

Species
Setosa        50
Versicolor    50
Virginica     50
Name: count, dtype: int64

In [28]:
data.isna().sum() ## It will check the null value present in data or not if yes then write in numerical format or not then show 0.

Sepal_Length    0
Sepal_Width     0
Petal_Length    0
Petal_Width     0
Species         0
dtype: int64

In [29]:
data = pd.read_csv('datasets/cars93.csv')

In [30]:
data.head()

,Manufacturer,Model,Type,Price,MPG.city,AirBags,Horsepower,Passengers,Rear.seat.room,Luggage.room
0,Acura,Integra,Small,15.9,25,Driver only,140,5,26.5,11.0
1,Acura,Legend,Midsize,33.9,18,Driver & Passenger,200,5,30.0,15.0
2,Audi,90,Compact,29.1,20,Driver only,172,5,28.0,14.0
3,Audi,100,Midsize,37.7,19,Driver & Passenger,172,6,31.0,17.0
4,BMW,535i,Midsize,30.0,22,Driver only,208,4,27.0,13.0

In [31]:
data.tail()

,Manufacturer,Model,Type,Price,MPG.city,AirBags,Horsepower,Passengers,Rear.seat.room,Luggage.room
88,Volkswagen,Eurovan,Van,19.7,17,Driver & Passenger,109,7,34.0,NaN
89,Volkswagen,Passat,Compact,20.0,21,Driver & Passenger,134,5,31.5,14.0
90,Volkswagen,Corrado,Sporty,23.3,18,Driver & Passenger,178,4,26.0,15.0
91,Volvo,240,Compact,22.7,21,Driver only,114,5,29.5,14.0
92,Volvo,850,Midsize,26.7,20,Driver & Passenger,168,5,30.0,15.0

In [32]:
data.shape

(93, 10)

In [35]:
# data['Manufacturer'].unique()
data['Manufacturer'].nunique() ## Data Analysis is a case sensitive languang.

32

In [36]:
data['Type'].value_counts()

Type
Midsize    22
Small      21
Compact    16
Sporty     14
Large      11
Van         9
Name: count, dtype: int64

In [37]:
data.isna().sum()

Manufacturer       0
Model              0
Type               0
Price              0
MPG.city           0
AirBags           14
Horsepower         0
Passengers         0
Rear.seat.room     2
Luggage.room      11
dtype: int64

In [41]:
data.info() #Print a concise summary of a DataFrame.

# This method prints information about a DataFrame including
# the index dtype and columns, non-null values and memory usage.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 93 entries, 0 to 92
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Manufacturer    93 non-null     object
 1   Model           93 non-null     object
 2   Type            93 non-null     object
 3   Price           93 non-null     float64
 4   MPG.city        93 non-null     int64
 5   AirBags         79 non-null     object
 6   Horsepower      93 non-null     int64
 7   Passengers      93 non-null     int64
 8   Rear.seat.room  91 non-null     float64
 9   Luggage.room    82 non-null     float64
dtypes: float64(3), int64(3), object(4)
memory usage: 7.4+ KB

In [44]:
data[data['Rear.seat.room'].isna()==True]  ## We can see missing value using isna()==true of a rear.seta.room.

,Manufacturer,Model,Type,Price,MPG.city,AirBags,Horsepower,Passengers,Rear.seat.room,Luggage.room
18,Chevrolet,Corvette,Sporty,38.0,17,Driver only,300,2,NaN,NaN
56,Mazda,RX-7,Sporty,32.5,17,Driver only,255,2,NaN,NaN

In [45]:
# data.drop([10,56]) #->> Do not use this one will out filling others values is will drop rows and decrease the data.
#  data1 =data.dropna() # we have to store in different variables.

In [49]:
data[data['AirBags'].isna()==True] ## Return null records in airbags.

,Manufacturer,Model,Type,Price,MPG.city,AirBags,Horsepower,Passengers,Rear.seat.room,Luggage.room
16,Chevrolet,Astro,Van,16.6,15,NaN,165,8,33.5,NaN
32,Ford,Tempo,Compact,11.3,22,NaN,96,5,27.5,13.0
46,Hyundai,Sonata,Midsize,13.9,20,NaN,128,5,31.0,14.0
53,Mazda,Protege,Small,11.6,28,NaN,103,5,26.5,13.0
61,Mitsubishi,Mirage,Small,10.3,29,NaN,92,5,26.0,11.0
65,Nissan,Quest,Van,19.1,17,NaN,151,7,27.0,NaN
67,Oldsmobile,Achieva,Compact,13.5,24,NaN,155,5,28.0,14.0
71,Plymouth,Laser,Sporty,14.4,23,NaN,92,4,24.5,8.0
72,Pontiac,LeMans,Small,9.0,31,NaN,74,4,25.5,17.0
73,Pontiac,Sunbird,Compact,11.1,23,NaN,110,5,25.0,13.0
79,Subaru,Justy,Small,8.4,33,NaN,73,4,23.5,10.0
80,Subaru,Loyale,Small,10.9,25,NaN,90,5,27.5,15.0
82,Suzuki,Swift,Small,8.6,39,NaN,70,4,27.5,10.0
87,Volkswagen,Fox,Small,9.1,25,NaN,81,4,26.0,10.0

In [51]:
data['AirBags'].unique()## Return the unique values.

array(['Driver only', 'Driver & Passenger', nan], dtype=object)

In [52]:
result = data['AirBags'].mode() ## Return the value that occurences multiple number of time.

In [53]:
result

0    Driver only
Name: AirBags, dtype: object

In [57]:
# data.loc[data['AirBags'].isna()==True,'AirBags'] = 'Driver only'  #-->> Fill the null in airbags to driver only in data.
data['AirBags']=data['AirBags'].fillna(result[0])

In [68]:
# data.isna().sum()

In [69]:
# data.head()

In [65]:
avg = data['Luggage.room'].mean()

In [67]:
avg ## Average of a luggage room.

np.float64(13.890243902439025)

In [80]:
data['Luggage.room'].fillna(avg,inplace = True) ## Fill the null value using avg in luggage room.

C:\Users\91814\AppData\Local\Temp\ipykernel_16804\1407083871.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['Luggage.room'].fillna(avg,inplace = True) ## Fill the null value using avg in luggage room.

In [72]:
# data.isna().sum()

In [74]:
data.shape

(93, 10)

In [79]:
data1 = data1 =data.dropna() ## We drop the null values and store in different variable [data1] -->> Dropna return the values do not chnage the original data so that's why we have to store in data1.

In [76]:
data1.isna().sum()

Manufacturer      0
Model             0
Type              0
Price             0
MPG.city          0
AirBags           0
Horsepower        0
Passengers        0
Rear.seat.room    0
Luggage.room      0
dtype: int64

In [77]:
data1.shape

(91, 10)